Revit 2027 API
SaveOptions.PreviewViewId Property
 The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId PreviewViewId { get; set; }
Public Property PreviewViewId As ElementId
	Get
	Set
public:
property ElementId^ PreviewViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member PreviewViewId : ElementId with get, set
Property Value
ElementId
 The id must be valid for use as a preview view (check DocumentPreviewSettings.IsViewIdValidForPreview()). Revit does not check validity when setting this value, only when the options are used in a call to SaveAs().
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 If this id is set, the indicated view will be used to generate the preview even if DocumentPreviewSettings.PreviewViewId is also set.
See Also
Reference
SaveOptions Class
Autodesk.Revit.DB Namespace